#include <stdio.h>
#include <stdlib.h>

int main()
{
    int t = 20;      // змінна типу ціле число
    float b = 10.12; // змінна типу дробове число
    // printf("aaa %d aaa", t); //%d специфікатор перетворення. Помістить t на місце %d у вигляді цілого числа
    t = (t + 2) * t + 5; // можливість стандартних математичних операцій
    printf("%d\n", t);
    printf("%f \n", b); //%f специфікатор перетворення. Помістить b на місце %f у вигляді дробового числа
    printf("%g \n", b); //%g специфікатор перетворення. Помістить b на місце %g у вигляді дробового числа. Але прибере нулі
    return 0;
}

